In [8]:
import numpy as np
import pandas as pd

In [14]:
diccionario = {"A":[11,12,10,12], "B":[14,18,16,17]}
dataframe = pd.DataFrame(diccionario, index=["i1","i2","i3","i4"])
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [15]:
dataframe["A"].unique()

array([11, 12, 10])

In [17]:
dataframe["A"].nunique()

3

In [18]:
dataframe["A"].value_counts()

12    2
10    1
11    1
Name: A, dtype: int64

In [21]:
def multiplicar(x):
    return x*2

In [20]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [22]:
dataframe["A"].apply(multiplicar)

i1    22
i2    24
i3    20
i4    24
Name: A, dtype: int64

In [23]:
dataframe["A"].apply(lambda x: x*2)

i1    22
i2    24
i3    20
i4    24
Name: A, dtype: int64

In [24]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [25]:
dataframe.drop("B", axis=1)

     A
i1  11
i2  12
i3  10
i4  12

In [27]:
dataframe.drop("i1")

     A   B
i2  12  18
i3  10  16
i4  12  17

In [28]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [29]:
dataframe.columns

Index(['A', 'B'], dtype='object')

In [30]:
dataframe.index

Index(['i1', 'i2', 'i3', 'i4'], dtype='object')

In [31]:
dataframe.sort_values("B")

     A   B
i1  11  14
i3  10  16
i4  12  17
i2  12  18